<a href="https://colab.research.google.com/github/donghyundavidchoi/Data_Analysis/blob/main/%EB%8D%B0%EC%9D%B4%ED%84%B0%EC%A0%95%EC%A0%9C/%EB%8D%B0%EC%9D%B4%ED%84%B0%EC%A0%95%EC%A0%9C_%EC%B6%94%EA%B0%80%EC%97%B0%EC%8A%B5%EB%AC%B8%EC%A0%9C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
!gdown --fuzzy https://drive.google.com/file/d/1txRVXp-Eh222PzIeTQ-fuAoUYFR9f7q-/view?usp=sharing
!mkdir -p ~/.kaggle
!cp /content/kaggle.json ~/.kaggle/
!chmod 600 ~/.kaggle/kaggle.json

Downloading...
From: https://drive.google.com/uc?id=1txRVXp-Eh222PzIeTQ-fuAoUYFR9f7q-
To: /content/kaggle.json
100% 73.0/73.0 [00:00<00:00, 90.1kB/s]

In [3]:
!kaggle datasets download -d agileteam/bigdatacertificationkr

Downloading bigdatacertificationkr.zip to /content
  0% 0.00/15.5k [00:00<?, ?B/s]
100% 15.5k/15.5k [00:00<00:00, 6.82MB/s]

In [4]:
!unzip /content/bigdatacertificationkr.zip

Archive:  /content/bigdatacertificationkr.zip
  inflating: basic1.csv
  inflating: basic1_json.json
  inflating: basic1_xml.xml
  inflating: basic2.csv
  inflating: basic3.csv

In [5]:
import pandas as pd

In [6]:
data1 = pd.read_csv('/content/basic1.csv')
data2 = pd.read_csv('/content/basic2.csv')

In [7]:
data1

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [8]:
data2

           Date     Sales      PV      UV  Events
0    2022-01-01  22711525  397349  4421.0       1
1    2022-01-02     36779    3969  2289.0       0
2    2022-01-03  13943875  373890     NaN       1
3    2022-01-04   8088593  142054  2157.0       0
4    2022-01-05   2395374  190684     NaN       0
..          ...       ...     ...     ...     ...
725  2023-12-27  33846609  415067  7360.0       1
726  2023-12-28   3659566  208601  2262.0       1
727  2023-12-29   1164008   14309   193.0       0
728  2023-12-30   3977696   60935     NaN       0
729  2023-12-31   3719764   60963  1507.0       0

[730 rows x 5 columns]

-----------
# basic1에서 데이터타입이 object인 컬럼을 추출하시오.

In [10]:
df1 = data1.copy()
print(df1.head())
print()
df1_object_cols = df1.select_dtypes('object').columns
print(df1_object_cols)

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

Index(['id', 'city', 'f3', 'f4'], dtype='object')

-----------
# baisc2에서 22년 월 Sales합이 제일 높은 달의 Sales와 23년 월 Sales합이 제일 낮은 달의 Sales의 합을 구하시오.

In [33]:
df2 = data2.copy()
print(df2.head())
print()
print(df2.info())
print()
df2['Date'] = pd.to_datetime(df2['Date'])
print(df2.info())
print()
df2['Year'] = df2['Date'].dt.year
df2['Month'] = df2['Date'].dt.month
print(df2.head())
print()
df2_groupby = df2.groupby(['Year', 'Month']).sum()
print(df2_groupby)
print()
max_sales_2022 = df2_groupby['Sales'].loc[2022].max()
min_sales_2023 = df2_groupby['Sales'].loc[2023].min()
print("max Sales in 2022 :", max_sales_2022)
print("min Sales in 2023 :", min_sales_2023)
print("Answer :", max_sales_2022 + min_sales_2023)

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    object
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 28.6+ KB
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 28.6 KB
None

        Date     Sales      PV      UV  Events  Year  Month
0 2022-01-01  22711525  397349  4421.0       1  2022      1
1 2022-01-02     36779    3969  2289.0       0  2022      1
2 2022-01-03  13943875  373890     NaN       1  2022      1
3 2022-01-04   8088593  142054  2157.0       0  2022      1
4 2022-01-05   2395374  190684     NaN       0  2022      1

                Sales       PV        UV  Events
Year Month
2022 1      129342654  3079961   50366.0       5
     2      180741394  3298119   68908.0       9
     3      200161616  4726549   86131.0       9
     4      126811278  3212413   57795.0       6
     5      141285007  3523070   58316.0       7
     6      183586082  3582375   70900.0       8
     7      221417897  4152793   74925.0      10
     8      123502487  2845228   64624.0       8
     9      186583144  4172376   79254.0      10
     10     213484807  4028003   73127.0      10
     11      93177201  2174862   48903.0       2
     12     222485234  4560909   70528.0      10
2023 1      209399623  3218529   70881.0       8
     2      183012964  3509886   64825.0       6
     3      231040983  5452760  104144.0      13
     4      127840344  3110817   68068.0      10
     5      162722159  3801324   75261.0       8
     6      149763613  4021823   60261.0       5
     7      147604761  3800007   68875.0       7
     8      146936241  3903836   82146.0       8
     9      257490149  3868057   61729.0      10
     10     168747678  3678288   60162.0       5
     11     283181917  4838421   86791.0      11
     12     160205422  3180960   68501.0       7

max Sales in 2022 : 222485234
min Sales in 2023 : 127840344
Answer : 350325578

----------
# basic2에서 2022년 주말 매출 표준편차와 2023년 주말 매출 표준편차의 차이를 구하시오. (소수점 둘째자리까지)

In [48]:
df3 = data2.copy()
print(df3.head())
print()
print(df3.info())
print()
df3['Date'] = pd.to_datetime(df3['Date'])
print(df3.info())
df3['Year'] = df3['Date'].dt.year
df3['DayOfWeek'] = df3['Date'].dt.dayofweek
print(df3.head())
print()
weekend_sales_std_2022 = df3['Sales'][(df3['Year'] == 2022) & (df3['DayOfWeek'] >= 5)].std()
weekend_sales_std_2023 = df3['Sales'][(df3['Year'] == 2023) & (df3['DayOfWeek'] >= 5)].std()
print("std of 2022 weekend sales :", weekend_sales_std_2022)
print("std of 2023 weekend sales :", weekend_sales_std_2023)
print("Difference :", round(abs(weekend_sales_std_2022 - weekend_sales_std_2023), 2))

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    object
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 28.6+ KB
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 28.6 KB
None
        Date     Sales      PV      UV  Events  Year  DayOfWeek
0 2022-01-01  22711525  397349  4421.0       1  2022          5
1 2022-01-02     36779    3969  2289.0       0  2022          6
2 2022-01-03  13943875  373890     NaN       1  2022          0
3 2022-01-04   8088593  142054  2157.0       0  2022          1
4 2022-01-05   2395374  190684     NaN       0  2022          2

std of 2022 weekend sales : 9665017.828372424
std of 2023 weekend sales : 7708071.419670158
Difference : 1956946.41

----------
# basic2를 Sales 기준 내림차순으로 정렬하고, 위에서 85%에 해당하는 데이터를 슬라이싱하고, Sales의 중앙값을 구하시오.

In [52]:
df4 = data2.copy()
print(df4.head())
print()
df4 = df4.sort_values(by='Sales', ascending=False)
print(df4.head())
print()
print(df4.shape)
print()
df4 = df4[:(round(len(df4)*0.85))]
print(df4.shape)
print()
print("Answer :", df4['Sales'].median())

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

           Date     Sales      PV      UV  Events
78   2022-03-20  53636725  654270  8786.0       1
340  2022-12-07  50051677  535678  5371.0       1
274  2022-10-02  45757271  544522  7782.0       1
690  2023-11-22  44961192  706913  7148.0       1
408  2023-02-13  44369343  467506     NaN       1

(730, 5)

(620, 5)

Answer : 3523623.5

-----------
# basic1의 f1 결측치를 f4 변수 별 f1값의 평균값으로 채우고 처리 전 후의 f1 평균 값의 차이를 구하시오. (소수점 둘째 자리까지)

In [54]:
df5 = data1.copy()
print(df5.isna().sum())
print()
mean_f1_before = df5['f1'].mean()
df5['f1'] = df5.groupby('f4')['f1'].apply(lambda x : x.fillna(x.mean()))
print(df5.isna().sum())
print()
mean_f1_after = df5['f1'].mean()
print("f1 mean before :", mean_f1_before)
print("f1 mean after :", mean_f1_after)
print("Difference :", round(abs(mean_f1_before - mean_f1_after),2))

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64

id       0
age      0
city     0
f1       0
f2       0
f3      95
f4       0
f5       0
dtype: int64

f1 mean before : 66.04347826086956
f1 mean after : 66.49088888888889
Difference : 0.45

-----------
# basic2의 Sales를 동일한 구간의 상중하로 나누고
# basic2의 Sales를 동일한 데이터 수의 상중하로 나누고
# 각 데이터의 중 라벨의 평균값의 차이를 계산하시오. (소수점 둘째 자리 까지)

In [63]:
df6 = data2.copy()
df6['cut'] = pd.cut(df6['Sales'], 3, labels=['low', 'middle', 'high'])
df6['qcut'] = pd.qcut(df6['Sales'], 3, labels=['low', 'middle', 'high'])
print(df6['cut'].value_counts())
print()
print(df6['qcut'].value_counts())
print()
cut_middle_mean = df6['Sales'][df6['cut'] == 'middle'].mean()
qcut_middle_mean = df6['Sales'][df6['qcut'] == 'middle'].mean()
print("cut_middle_mean :", cut_middle_mean)
print("qcut_middle_mean :", qcut_middle_mean)
print("Difference : ", round(abs(cut_middle_mean - qcut_middle_mean), 2))

low       674
middle     45
high       11
Name: cut, dtype: int64

low       244
middle    243
high      243
Name: qcut, dtype: int64

cut_middle_mean : 23869489.955555554
qcut_middle_mean : 2762072.716049383
Difference :  21107417.24

---------
# basic2의 Sales를 기준으로 IQR 방식으로 이상치 구간을 구하고 이상치 구간에 포함되는 데이터의 수를 구하시오.

In [65]:
df7 = data2.copy()
Q3 = df7['Sales'].quantile(0.75)
Q1 = df7['Sales'].quantile(0.25)
IQR = Q3 - Q1
print(len(df7['Sales'][(df7['Sales'] > (Q3 + 1.5*IQR)) | (df7['Sales'] < (Q1 - 1.5*IQR))]))

54

--------
# basic1 age의 소수점 아래 값을 가진 데이터를 삭제하고 데이터형식을 int로 변경하시오.

In [78]:
df8 = data1.copy()
print(df8.shape)
print()
print(df8.head())
print()
print(df8.info())
print()
float_age_index = df8[(df8['age'] % 1) != 0].index
df8 = df8.drop(index=float_age_index)
print(df8.shape)
print()
print(df8.head())
print()
print(df8.info())
print()
df8['age'] = df8['age'].astype('int64')
print(df8.info())

(100, 8)

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      100 non-null    object
 1   age     100 non-null    float64
 2   city    100 non-null    object
 3   f1      69 non-null     float64
 4   f2      100 non-null    int64
 5   f3      5 non-null      object
 6   f4      100 non-null    object
 7   f5      100 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.4+ KB
None

(92, 8)

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

<class 'pandas.core.frame.DataFrame'>
Int64Index: 92 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      92 non-null     object
 1   age     92 non-null     float64
 2   city    92 non-null     object
 3   f1      62 non-null     float64
 4   f2      92 non-null     int64
 5   f3      5 non-null      object
 6   f4      92 non-null     object
 7   f5      92 non-null     float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.5+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 92 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      92 non-null     object
 1   age     92 non-null     int64
 2   city    92 non-null     object
 3   f1      62 non-null     float64
 4   f2      92 non-null     int64
 5   f3      5 non-null      object
 6   f4      92 non-null     object
 7   f5      92 non-null     float64
dtypes: float64(2), int64(2), object(4)
memory usage: 6.5+ KB
None

--------
# baisc1 f4의 ESTJ를 ESTP로 바꾸고, 바꾸기 전의 ESTP age 중앙값과, 바꾼 후의 ESTP age 중앙값의 차이를 구하시오. (소수점 둘쨰 자리 까지)

In [84]:
df9 = data1.copy()
print(df9['f4'].value_counts())
print()
ESTP_age_median_before = df9['age'][df9['f4'] == 'ESTP'].median()
df9['f4'] = df9['f4'].replace('ESTJ', 'ESTP')
print(df9['f4'].value_counts())
print()
ESTP_age_median_after = df9['age'][df9['f4'] == 'ESTP'].median()
print("ESTP_age_median_before :", ESTP_age_median_before)
print("ESTP_age_median_after :", ESTP_age_median_after)
print("Diffrence :", round(abs(ESTP_age_median_before - ESTP_age_median_after), 2))

ESTP    11
ISFJ    10
ISFP    10
ESTJ     9
INTP     8
ENFJ     6
INFP     6
ENFP     6
ENTP     6
ESFJ     5
ENTJ     5
INFJ     4
ESFP     4
ISTP     4
INTJ     4
ISTJ     2
Name: f4, dtype: int64

ESTP    20
ISFJ    10
ISFP    10
INTP     8
ENFJ     6
INFP     6
ENFP     6
ENTP     6
ESFJ     5
ENTJ     5
INFJ     4
ESFP     4
ISTP     4
INTJ     4
ISTJ     2
Name: f4, dtype: int64

ESTP_age_median_before : 45.0
ESTP_age_median_after : 48.5
Diffrence : 3.5

------
# baisc1에서 f1 결측치가 있는 데이터를 삭제하고, 가장 수가 많은 f4 값을 구하시오.

In [96]:
df10 = data1.copy()
print(df10.shape)
print()
print(df10.isna().sum())
print()
df10 = df10.dropna(subset=['f1'], axis=0)
print(df10.shape)
print()
print(df10.isna().sum())
print()
print("Answer :", df10['f4'][df10['f4'].value_counts().max()])

(100, 8)

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64

(69, 8)

id       0
age      0
city     0
f1       0
f2       0
f3      65
f4       0
f5       0
dtype: int64

Answer : ISFP